anpaza/ugears/tests/stm32vldiscovery/04.uartdma/main.c
#include "stm32vldiscovery.h"
#include "dma.h"
#include "nvic.h"

static const char test_data [] = "[This data came via DMA controller]\r\n";
static char rxbuff [10];
static volatile bool dma_tx_flag, dma_rx_flag;

void DMA_IRQ_HANDLER (USART1_TX) ()
{
    if (DMA (USART1_TX)->ISR & DMA_ISR (USART1_TX, GIF))
    {
        // Acknowledge the interrupt
        DMA (USART1_TX)->IFCR = DMA_IFCR (USART1_TX, CGIF);

        // Disable USART1 -> DMA transmission
        USART1->CR3 &= ~USART_CR3_DMAT;

        printf ("DMA TX IRQ\r\n");

        dma_tx_flag = true;
    }
}

static void do_test_send ()
{
    printf ("Sending some data via DMA ... NOW!\r\n");

    dma_tx_flag = false;

    // Use a more general form of dma1_copy
    DMA_COPY (USART1_TX,
        DMA_CCR_PSIZE_8 | DMA_CCR_MSIZE_8 | DMA_CCR_MINC | DMA_CCR_PL_VERYHIGH | DMA_CCR_TCIE,
        (void *)test_data, &USART1->DR, sizeof (test_data) - 1);

    // Enable USART1 -> DMA transmission
    USART1->CR3 |= USART_CR3_DMAT;

    // Wait until the data finishes transfer
    while (!dma_tx_flag)
        ;

    printf ("Got something?\r\n");
}

void DMA_IRQ_HANDLER (USART1_RX) ()
{
    if (DMA (USART1_RX)->ISR & DMA_ISR (USART1_RX, GIF))
    {
        // Acknowledge the interrupt
        DMA (USART1_RX)->IFCR = DMA_IFCR (USART1_RX, CGIF);

        // Disable USART1 -> DMA transmission
        USART1->CR3 &= ~USART_CR3_DMAR;

        printf ("DMA RX IRQ\r\n");

        dma_rx_flag = true;
    }
}

static void do_test_recv ()
{
    printf ("Waiting for %d bytes from USART using DMA...\r\n"
            "Go on, send something\r\n", sizeof (rxbuff));

    dma_rx_flag = false;

    // Use a more general form of dma1_copy
    DMA_COPY (USART1_RX,
        DMA_CCR_PSIZE_8 | DMA_CCR_MSIZE_8 | DMA_CCR_MINC | DMA_CCR_PL_VERYHIGH | DMA_CCR_TCIE,
        (void *)&USART1->DR, (void *)rxbuff, sizeof (rxbuff));

    // Enable DMA -> USART transmission
    USART1->CR3 |= USART_CR3_DMAR;

    // Wait until DMA finishes
    while (!dma_rx_flag)
        ;

    printf ("Got [%10s]\r\n", rxbuff);
}

int main (void)
{
    // Enable DMA
    RCC_ENABLE (RCC_DMA (USART1_TX));

    usart1_init ();
    printf ("DMA demo started\r\n");

    // Set up and enable interrupts
    nvic_setup (DMA_IRQ (USART1_TX), DMA_IRQ_PRIO (USART1_TX));
    nvic_setup (DMA_IRQ (USART1_RX), DMA_IRQ_PRIO (USART1_RX));
    __enable_irq ();

    for (;;)
    {
        if (usart_rx_ready (USART1))
            switch (usart_getc (USART1))
            {
                case 's':
                    do_test_send ();
                    break;

                case 'r':
                    do_test_recv ();
                    break;

                default:
                    printf ("s: Send test data via USART1+DMA\r\n"
                            "r: Receive data via USART1+DMA\r\n");
                    break;
            }

        // We can't _WFI() because usart_rx_ready() polls
        //__WFI ();
    }
}
